'''
1 > [1,1,1,1,1,1,1,1,1,1] [10,9,8,7,6,5,4,3,2,1]
2 > [1,2,3,4,5,6,7,8,9,10]
[00,01,02,03,04,05,06,07,08,09,
11,12,13,14,15,16,17,18,19
22,23,24,25,26,27,28,29,
33,34,35,36,37,38,39,
44,45,46,47,48,49,
55,56,57,58,59,
66,67,68,69,
77,78,79,
88,89,
99]

자리 수 마다 끝나는 수의 개수 파악 >> 다음 자리 수 개수 == [끝나는 수] * [10,9,8,7,6,5,4,3,2,1]
자리 수 마다 끝나는 수의 개수 == cumsum
'''

ans = [0,10]
s = [1,1,1,1,1,1,1,1,1,1]
mul = [10,9,8,7,6,5,4,3,2,1]
for i in range(64):
    ans += [sum([x*y for x,y in zip(s,mul)])]
    tmp = [s[0]]
    for i in range(1,10):
        tmp += [tmp[-1] + s[i]]
    s = tmp

from sys import stdin
stdin = open("in.txt")
T = int(stdin.readline())
for _ in range(T):
    print(ans[int(stdin.readline())])
print(ans[1])