# 모든 경우의 수
# 깔끔하게 풀 방법이 있나..
import sys

sys.stdin = open("C:\\Users\\LYJ_lab\\Desktop\\동현\\coding-test\\bj\\class 3\\in.txt","r")

N,M = map(int,sys.stdin.readline().rstrip().split())
maps = [list(map(int,sys.stdin.readline().rstrip().split())) for _ in range(N)]

rec = [[(0,0),(0,1),(0,2),(0,3)],[(0,0),(1,0),(2,0),(3,0)], 
[(0,0),(0,1),(1,0),(1,1)],

[(0,0),(1,0),(2,0),(2,1)],
[(0,0),(1,0),(2,0),(2,-1)],
[(0,0),(1,0),(2,0),(0,-1)],
[(0,0),(1,0),(2,0),(0,1)],

[(0,0),(0,1),(0,2),(1,2)],
[(0,0),(0,1),(0,2),(-1,2)],
[(0,0),(0,1),(0,2),(1,0)],
[(0,0),(0,1),(0,2),(-1,0)],

[(0,0),(1,0),(1,1),(2,1)],
[(0,0),(1,0),(1,-1),(2,-1)],
[(0,0),(0,1),(1,1),(1,2)],
[(0,0),(0,-1),(1,-1),(1,-2)],

[(0,0),(0,1),(0,2),(1,1)],
[(0,0),(0,1),(0,2),(-1,1)],
[(0,0),(1,0),(2,0),(1,1)],
[(0,0),(1,0),(2,0),(1,-1)]]


ans = -1
for i in range(N):
    for j in range(M):
        for tmp in rec:
            v = 0
            for x,y in tmp:
                if 0 <= x + i < N and 0 <= y + j < M:
                    v += maps[x + i][y + j]
                else:
                    break
            else:
                if v > ans:
                    ans = v

print(ans)
